# Summarizing and Computing Descriptive Statistics

In [83]:
import pandas as pd
import numpy as np
import seaborn as sns
import statistics as stats

### Just a quick word on displaying DataFrames

In [84]:
#All display options available
pd.describe_option()

compute.use_bottleneck : bool
    Use the bottleneck library to accelerate if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
compute.use_numexpr : bool
    Use the numexpr library to accelerate computation if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]
display.chop_threshold : float or None
    if set to a float value, all float values smaller then the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]
display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]
display.column_space No description available.
    [default: 12] [currently: 12]
display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]
display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]
display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]
display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]
display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: None]
display.html.border : int
    A ``border=value`` attribute is inserted in the ``<table>`` tag
    for the DataFrame HTML repr.
    [default: 1] [currently: 1]
display.html.table_schema : boolean
    Whether to publish a Table Schema representation for frontends
    that support it.
    (default: False)
    [default: False] [currently: False]
display.html.use_mathjax : boolean
    When True, Jupyter notebook will process table contents using MathJax,
    rendering mathematical expressions enclosed by the dollar symbol.
    (default: True)
    [default: True] [currently: True]
display.large_repr : 'truncate'/'info'
    For DataFrames exceeding max_rows/max_cols, the repr (and HTML repr) can
    show a truncated table (the default from 0.13), or switch to the view from
    df.info() (the behaviour in earlier versions of pandas).
    [default: truncate] [currently: truncate]
display.latex.escape : bool
    This specifies if the to_latex method of a Dataframe uses escapes special
    characters.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.longtable :bool
    This specifies if the to_latex method of a Dataframe uses the longtable
    format.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.multicolumn : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: True] [currently: True]
display.latex.multicolumn_format : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: l] [currently: l]
display.latex.multirow : bool
    This specifies if the to_latex method of a Dataframe uses multirows
    to pretty-print MultiIndex rows.
    Valid values: False,True
    [default: False] [currently: False]
display.latex.repr : boolean
    Whether to produce a latex DataFrame representation for jupyter
    environments that support it.
    (default: False)
    [default: False] [currently: False]
display.max_categories : int
    This sets the maximum number of categories pandas should output when
    printing out a `Categorical` or a Series of dtype "category".
    [default: 8] [currently: 8]
display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 20]
display.max_colwidth : int or None
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output. A 'None' value means unlimited.
    [default: 50] [currently: 50]
display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]
display.max_info_rows : int or None
    df.info() will usually show null-counts for each column.
    For large frames this can be quite slow. max_info_rows and max_info_cols
    limit this null check only to frames with smaller dimensions than
    specified.
    [default: 1690785] [currently: 1690785]
display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 60]
display.max_seq_items : int or None
    when pretty-printing a long sequence, no more then `max_seq_items`
    will be printed. If items are omitted, they will be denoted by the
    addition of "..." to the resulting string.

    If set to None, the number of items to be printed is unlimited.
    [default: 100] [currently: 100]
display.memory_usage : bool, string or None
    This specifies if the memory usage of a DataFrame should be displayed when
    df.info() is called. Valid values True,False,'deep'
    [default: True] [currently: True]
display.min_rows : int
    The numbers of rows to show in a truncated view (when `max_rows` is
    exceeded). Ignored when `max_rows` is set to None or 0. When set to
    None, follows the value of `max_rows`.
    [default: 10] [currently: 10]
display.multi_sparse : boolean
    "sparsify" MultiIndex display (don't display repeated
    elements in outer levels within groups)
    [default: True] [currently: True]
display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]
display.pprint_nest_depth : int
    Controls the number of nested levels to process when pretty-printing
    [default: 3] [currently: 3]
display.precision : int
    Floating point output precision (number of significant digits). This is
    only a suggestion
    [default: 6] [currently: 6]
display.show_dimensions : boolean or 'truncate'
    Whether to print out dimensions at the end of DataFrame repr.
    If 'truncate' is specified, only print out the dimensions if the
    frame is truncated (e.g. not display all rows and/or columns)
    [default: truncate] [currently: truncate]
display.unicode.ambiguous_as_wide : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.unicode.east_asian_width : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]
display.width : int
    Width of the display in characters. In case python/IPython is running in
    a terminal this can be set to None and pandas will correctly auto-detect
    the width.
    Note that the IPython notebook, IPython qtconsole, or IDLE do not run in a
    terminal and hence it is not possible to correctly detect the width.
    [default: 80] [currently: 80]
io.excel.ods.reader : string
    The default Excel reader engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]
io.excel.xls.reader : string
    The default Excel reader engine for 'xls' files. Available options:
    auto, xlrd.
    [default: auto] [currently: auto]
io.excel.xls.writer : string
    The default Excel writer engine for 'xls' files. Available options:
    auto, xlwt.
    [default: auto] [currently: auto]
io.excel.xlsb.reader : string
    The default Excel reader engine for 'xlsb' files. Available options:
    auto, pyxlsb.
    [default: auto] [currently: auto]
io.excel.xlsm.reader : string
    The default Excel reader engine for 'xlsm' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsm.writer : string
    The default Excel writer engine for 'xlsm' files. Available options:
    auto, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.reader : string
    The default Excel reader engine for 'xlsx' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]
io.excel.xlsx.writer : string
    The default Excel writer engine for 'xlsx' files. Available options:
    auto, openpyxl, xlsxwriter.
    [default: auto] [currently: auto]
io.hdf.default_format : format
    default format writing format, if None, then
    put will default to 'fixed' and append will default to 'table'
    [default: None] [currently: None]
io.hdf.dropna_table : boolean
    drop ALL nan rows when appending to a table
    [default: False] [currently: False]
io.parquet.engine : string
    The default parquet reader/writer engine. Available options:
    'auto', 'pyarrow', 'fastparquet', the default is 'auto'
    [default: auto] [currently: auto]
mode.chained_assignment : string
    Raise an exception, warn, or no action if trying to use chained assignment,
    The default is warn
    [default: warn] [currently: warn]
mode.sim_interactive : boolean
    Whether to simulate interactive mode for purposes of testing
    [default: False] [currently: False]
mode.use_inf_as_na : boolean
    True means treat None, NaN, INF, -INF as NA (old way),
    False means None and NaN are null, but INF, -INF are not NA
    (new way).
    [default: False] [currently: False]
mode.use_inf_as_null : boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.
    [default: False] [currently: False]
    (Deprecated, use `mode.use_inf_as_na` instead.)
plotting.backend : str
    The plotting backend to use. The default value is "matplotlib", the
    backend provided with pandas. Other backends can be specified by
    prodiving the name of the module that implements the backend.
    [default: matplotlib] [currently: matplotlib]
plotting.matplotlib.register_converters : bool or 'auto'.
    Whether to register converters with matplotlib's units registry for
    dates, times, datetimes, and Periods. Toggling to False will remove
    the converters, restoring any converters that pandas overwrote.
    [default: auto] [currently: auto]

In [85]:
#Returns the number of rows that will be displayed 
pd.get_option('display.max_rows')

60

In [86]:
#Change the number of rows to be displayed. None prints all the rows in the data frame
pd.set_option('display.max_rows', None)

In [87]:
#To reset any changes :
pd.reset_option('display.max_rows')

## Summarize data

In [88]:
df = pd.DataFrame(np.arange(8).reshape(4,2),
                     index=['a', 'b', 'c', 'd'],
                     columns=['one', 'two'])
df

   one  two
a    0    1
b    2    3
c    4    5
d    6    7

In [89]:
#Let's get the info for this DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     4 non-null      int64
 1   two     4 non-null      int64
dtypes: int64(2)
memory usage: 96.0+ bytes

In [90]:
#Should always check the dimensions of our DataFrame
df.shape

(4, 2)

In [91]:
#Let's look at the number of values in the dataframe
df.count()

one    4
two    4
dtype: int64

In [115]:
#If we want to know how many unique values there are in a given column
# print(df.two.nunique())
# df

#Sanity check, let's change a value and check again :
# df['two'].b = 5
# print(df.count())
# df.info()
# df.two.nunique()

#Or get the number of unique values for every column
df.nunique()

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/pandas/core/generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

one     4
two     3
name    3
dtype: int64

In [113]:
#What are those unique values ?
df.two.unique()

array([ 1., nan,  5.,  7.])

In [116]:
#Let's add a new column with names 
df['name'] = ['John', 'Tim', 'John', 'Chris']
df

   one  two   name
a    0  1.0   John
b    2  5.0    Tim
c    4  5.0   John
d    6  7.0  Chris

In [117]:
#Let's now get the number of times each name appears:
df['name'].value_counts()

John     2
Chris    1
Tim      1
Name: name, dtype: int64

### There are two way of going about descriptive statistics : 
### - describing the values of observations in a variable : sum, mean, median, min/max
### - describing the variable spread : sd, variance, counts, quartiles

### Pivot tables are making a come back

In [118]:
df

   one  two   name
a    0  1.0   John
b    2  5.0    Tim
c    4  5.0   John
d    6  7.0  Chris

In [119]:
#Remember pivot tables will group your data and provide helpful summaries
pd.pivot_table(df, values = ['one', 'two'], index = ['name'], aggfunc=np.mean)

       one  two
name
Chris    6  7.0
John     2  3.0
Tim      2  5.0

In [122]:
#We can calculate mutliple statistics at once :
data = pd.pivot_table(df, values = ['one', 'two'], index = ['name'], aggfunc=[np.mean, np.sum])
data

      mean      sum
       one  two one  two
name
Chris    6  7.0   6  7.0
John     2  3.0   4  6.0
Tim      2  5.0   2  5.0

In [125]:
#We can use the unstack() function to change how we display the results based on the function instead of index
# pd.DataFrame(pd.pivot_table(df, values = ['one', 'two'], 
#                             index = ['name'], aggfunc=[np.mean, np.sum]).unstack())

#Let's access the data for John only. 
data.loc['John']

#Now lets access John's mean values
data.loc['John', 'mean']

one    2.0
two    3.0
Name: John, dtype: float64

### Notice that for the parameter aggfunc we can pass in numpy functions. A list of those functions can be found [here](https://docs.scipy.org/doc/numpy/reference/routines.statistics.html)

In [126]:
#The argument aggfunc can be passed in a variety of functions to calculate different statistics on different 
#columns
pd.pivot_table(df, values = ['one', 'two'], index = ['name'], aggfunc={'one':[np.mean, np.max], 'two':np.sum})

       one       two
      amax mean  sum
name
Chris    6    6  7.0
John     4    2  6.0
Tim      2    2  5.0

### We can also use the aggregate function on the dataframes and pass in numpy functions

In [127]:
#Aggregate takes in numpy functions
df['one'].aggregate([np.sum, np.min])

sum     12
amin     0
Name: one, dtype: int64

### Let's now look at some of the pandas built-in stats functions

In [132]:
#Get total values for each column (row wise)
# df.sum(numeric_only=True)
# df
df.sum()

#We have some interesting results....

one                   12
two                   18
name    JohnTimJohnChris
dtype: object

In [137]:
#Get the mean value for each column (row wise)
df.mean(axis=0) #row
# df.mean(axis=1) #column

one    3.0
two    4.5
dtype: float64

In [135]:
#Get the maximum value for each column (row wise)
df.max()

one       6
two       7
name    Tim
dtype: object

In [136]:
#Get the maximum value for each column (row wise)
df.min()

one         0
two         1
name    Chris
dtype: object

In [139]:
#Say we want to get the location of where the maximum/minimum value for column two is...
df.two.idxmax()

'd'

In [142]:
# Can u guess a method to get a summary stats?
df.describe()

            one       two
count  4.000000  4.000000
mean   3.000000  4.500000
std    2.581989  2.516611
min    0.000000  1.000000
25%    1.500000  4.000000
50%    3.000000  5.000000
75%    4.500000  5.500000
max    6.000000  7.000000

In [150]:
#We get a neat litte table with all the stats that we calculated before
df.describe(include='all')


# pd.pivot_table(df, values = ['one', 'two'], index = ['name'], 
#                aggfunc={'one':[np.mean, np.max], 
#                         'two':[np.sum, np.min],
#                        'name':np.unique})

             one       two  name
count   4.000000  4.000000     4
unique       NaN       NaN     3
top          NaN       NaN  John
freq         NaN       NaN     2
mean    3.000000  4.500000   NaN
std     2.581989  2.516611   NaN
min     0.000000  1.000000   NaN
25%     1.500000  4.000000   NaN
50%     3.000000  5.000000   NaN
75%     4.500000  5.500000   NaN
max     6.000000  7.000000   NaN

In [151]:
#Only include object types
df.describe(include=['object'])

        name
count      4
unique     3
top     John
freq       2

In [152]:
#Include object and float types
df.describe(include=['object', 'float'])

             two  name
count   4.000000     4
unique       NaN     3
top          NaN  John
freq         NaN     2
mean    4.500000   NaN
std     2.516611   NaN
min     1.000000   NaN
25%     4.000000   NaN
50%     5.000000   NaN
75%     5.500000   NaN
max     7.000000   NaN

In [153]:
#We can filter the data first and then describe it. 
df[df['name'] == 'John'].describe()

            one       two
count  2.000000  2.000000
mean   2.000000  3.000000
std    2.828427  2.828427
min    0.000000  1.000000
25%    1.000000  2.000000
50%    2.000000  3.000000
75%    3.000000  4.000000
max    4.000000  5.000000

### A quick look at a dataframe with NaN values

In [154]:
df2 = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                       [np.nan, np.nan], [0.75, -1.3]],
                     index=['a', 'b', 'c', 'd'],
                     columns=['one', 'two'])
df2

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [155]:
#By default the sum() function skips NaN values
df2.sum()

one    9.25
two   -5.80
dtype: float64

In [156]:
#If we do not, then we get NaN whenever there are NaN values
df2.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [157]:
#These functions will by default ignore the NaN values, it is not a reason to not deal with them though...
df2.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

## There is a built-in statistics package called **drumroll* * statistics....

All documentation for this package can be found [here](https://docs.python.org/3/library/statistics.html#module-statistics)

This package includes most of the functions we've just seen like : mean, mode, median, quantiles and so on.

### Demo with a dataframe that has more than a few values in it

In [158]:
cars = sns.load_dataset('car_crashes')
cars.head()

#Let's focus on insurance premiums

,total,speeding,alcohol,not_distracted,no_previous,ins_premium,ins_losses,abbrev
0,18.8,7.332,5.640,18.048,15.040,784.55,145.08,AL
1,18.1,7.421,4.525,16.290,17.014,1053.48,133.93,AK
2,18.6,6.510,5.208,15.624,17.856,899.47,110.35,AZ
3,22.4,4.032,5.824,21.056,21.280,827.34,142.39,AR
4,12.0,4.200,3.360,10.920,10.680,878.41,165.63,CA

In [166]:
#Let's use some the statistics we've seen but using the statistics package :

#Let's check out the mean :
# stats.mean(cars['ins_premium'])

#Let's get the median insurance premium :
# stats.median(cars['ins_premium'])

# #Is the median an actual value in the data or was it interpolated ?
# cars[cars['ins_premium'] == 858.97]

# #Assuming that the value is not in the data set, let's use the median_low, median_high
stats.median_low(cars['ins_premium'])
stats.median_high(cars['ins_premium'])  #Why are we getting the same value ?....

858.97

In [169]:
#Some other statistics in the package :

# stats.mode(cars['ins_premium'])

#Add a few values to the series
cars_prem = cars['ins_premium']
cars_prem_concat = cars_prem.append(pd.Series([2,2,2,2,1,1,1]))

#Let's look at the mode now :
stats.mode(cars_prem_concat)

2.0

In [173]:
#If we look at the spread of the variable ins_prem :

# Population standard deviation of data.
# stats.pstdev(cars['ins_premium'])

# Population variance of data.
# stats.pvariance(cars['ins_premium'])

# Sample standard deviation of data.
# stats.stdev(cars['ins_premium'])

# Sample variance of data.
# stats.variance(cars['ins_premium'])

31789.56517035294

## Let's look at another data set

In [174]:
#Let's read in some baby names :
df_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
df_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [175]:
df_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [176]:
df_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [177]:
#Drop useless columns like ID and Unnamed:0
df_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
df_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

In [185]:
#Let's get the number of names per gender :
df_names['Gender'].value_counts()

# df_names.groupby('Gender').sum()

F    558846
M    457549
Name: Gender, dtype: int64

In [187]:
#Number of unique names regardless of gender :
df_names['Name'].nunique()

17632

In [190]:
#What is the most popular name there is ?....
df_names.groupby('Name').Count.sum().idxmax()

'Jacob'

In [193]:
#Let's look at the 5 most popular names 
df_names.groupby('Name').Count.sum().nlargest(10)

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
William     197894
Joshua      191551
Sophia      191446
Daniel      191440
Emily       190318
Name: Count, dtype: int64

In [198]:
#We can also sort the names based on their count
df_names.sort_values("Count", ascending = 0).head(10)

           Name  Year Gender State  Count
107416   Daniel  2004      M    CA   4167
110097   Daniel  2005      M    CA   3914
115739   Daniel  2007      M    CA   3865
112872   Daniel  2006      M    CA   3826
107417  Anthony  2004      M    CA   3805
115740  Anthony  2007      M    CA   3782
112873  Anthony  2006      M    CA   3774
118707   Daniel  2008      M    CA   3749
110098  Anthony  2005      M    CA   3745
112874    Angel  2006      M    CA   3687

In [199]:
#Let's look at the summary of all of these statistics :
pd.DataFrame(df_names['Count'].describe())

              Count
count  1.016395e+06
mean   3.485012e+01
std    9.739735e+01
min    5.000000e+00
25%    7.000000e+00
50%    1.100000e+01
75%    2.600000e+01
max    4.167000e+03

In [200]:
#Let's take a look at the total count for each name :
df_names.groupby('Name').Count.sum()

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

In [204]:
# and the highest count :
df_names.groupby('Name').Count.sum().max()

# which is...
df_names.groupby('Name').Count.sum().idxmax()

'Jacob'

In [205]:
#Let's look at the pandas built-in stats function again :
df_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03

In [213]:
#Let's filter out some data using multiple conditions :
# df_names[(df_names.Count >= 2000) & (df_names.Year >= 2012)]

# We can filter based on other criteria :
# df_names[df_names.Name.isin(['Sophia','Emma'])]

# and again :
df_names[df_names.Name != 'Sophia']

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1015832 rows x 5 columns]

In [220]:
# We might need to do some preprocessing on strings before working with them :
# df_names['upper_names'] = df_names['Name'].str.upper()
# df_names

# we also have lower(), title()

# Other preprocessing :
# Get length of string :
# df_names['len'] = df_names['Name'].str.len()

# Contains part of a word/term :
# df_names[df_names['Name'].str.contains('m', case=False)]

# pd.Series.str.contains?

# We might need to replace part of the string :
df_names['Name'].str.replace('original_word', 'replacement_word')

In [222]:
#We want control over the stats we get :
# df_names.groupby(['Name']).Count.agg(['sum','mean','max','min'])


# We can create a multi-index table with the stats we want :
df_names.groupby(['Year','Gender']).Count.agg(['sum', 'mean', 'min', 'max'])

                 sum       mean  min   max
Year Gender
2004 F       1523496  31.684712    5  3416
     M       1770488  46.182226    5  4167
2005 F       1528165  31.062790    5  3282
     M       1777150  45.222403    5  3914
2006 F       1564886  30.773947    5  3101
     M       1822851  44.511892    5  3826
2007 F       1576648  30.184324    5  2961
     M       1835769  43.607036    5  3865
2008 F       1544411  29.379299    5  2788
     M       1795907  42.354299    5  3749
2009 F       1493172  28.722027    5  3158
     M       1738944  40.799212    5  3391
2010 F       1439346  28.176063    5  3364
     M       1677202  39.722474    5  3347
2011 F       1422539  28.085112    5  3562
     M       1656606  39.542798    5  3165
2012 F       1422020  28.035566    5  3634
     M       1651838  39.048697    5  2971
2013 F       1419351  28.139393    5  3451
     M       1647092  38.935584    5  2879
2014 F       1446259  28.341348    5  3162
     M       1667352  38.669512    5  2761

In [225]:
# We can get the smallest/largest values as well :
# df_names.groupby('Name').Count.sum().nlargest(5)

# df_names.groupby('Name').Count.sum().nsmallest(5)

# Or we can sort the values :
df_names.groupby('Name').Count.sum().nlargest(5)

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
Name: Count, dtype: int64